sWahlinRhoades/uTaskerModified/Applications/uTaskerV1.4/app_hw_lm3sxxxx.h
/**********************************************************************
   Mark Butcher    Bsc (Hons) MPhil MIET

   M.J.Butcher Consulting
   Birchstrasse 20f,    CH-5406, Rütihof
   Switzerland

   www.uTasker.com    Skype: M_J_Butcher

   ---------------------------------------------------------------------
   File:        app_hw_lm3sxxxx.h
   Project:     uTasker Demonstration project
   ---------------------------------------------------------------------
   Copyright (C) M.J.Butcher Consulting 2004..2019
   *********************************************************************
   Application specific hardware configuration

   07.12.2008 Add SYSTICK priority and change peripheral priorities      {1}
   16.12.2008 Add LM3S3748/LM3S3768/LM3S5732 setup                       {2}
   16.01.2009 SST SPI FLASH support                                      {3}
   17.01.2009 Add LP3S2110 setup                                         {4}
   18.01.2009 Device UART number moved to LM3Sxxxx.h
   03.02.2009 Add TIMER interrupt and MODBUS timer configuration         {5}
   28.02.2009 Add timing test output port                                {6}
   12.03.2009 Add user definable SET_SPI_FLASH_MODE() and REMOVE_SPI_FLASH_MODE() {7}
   31.03.2009 Add ADC support                                            {8}
   09.05.2009 Add GLCD configuration                                     {9}
   16.05.2009 Add OLED configuration                                     {10}
   03.08.2009 Add _LM3S2139 board configuration                          {11}
   12.08.2009 Set up keyscan configuration                               {12}
   26.09.2009 Add GLCD configuration for Samsung based GLCD              {13}
   26.09.2009 Add OLED GLCD mode configuration                           {14}
   01.10.2009 Move "../../Hardware/Luminary/LM3SXXXX.h" include from types.h to this file, after detailed chip defines {15}
   05.10.2009 Add CGLCD_GLCD_MODE GLCD mode configuration                {16}
   15.10.2009 Add additional ST SPI FLASH devices                        {17}
   16.10.2009 Add NUMBER_EXTERNAL_SERIAL when serial interface active    {18}
   05.11.2009 Add EK_LM3S9B90 and TICK_INTERRUPT()                       {19}
   29.11.2009 Configure LAN_REPORT_ACTIVITY LEDs                         {20}
   29.11.2009 Adapt uFileSystem to LM3S9BXX                              {21}
   11.12.2009 Add SD-card interface                                      {22}
   22.02.2010 Correct SPI_FLASH_AT45DB161, SPI_FLASH_AT45DB321 and SPI_FLASH_AT45DB642 sizes {23}
   13.05.2010 Add IDM_L35_B inteligent display module with 3.5" TFT and touch screen (LM3S1958) {24}
   24.08.2010 Use port macro for SPI FLASH CS configuration              {25}
   28.09.2010 Add external UART configuration                            {26}
   10.10.2010 Add MODBUS_TIMER_16BIT to enable 16 bit timer channels to be used by MODBUS rather than full 32 bit timers {27}
   27.12.2010 Add #define SUPPORT_PWM_CONTROLLER                         {28}
   22.02.2011 Add INITIALISE_MONITOR_TIMER() and EXECUTION_DURATION()    {29}
   22.02.2011 Add DK_LM3S9B96                                            {30}

*/

#if defined _LM3SXXXX && !defined __APP_HW_LM3SXXXX__
#define __APP_HW_LM3SXXXX__

#ifdef _WINDOWS
    #define _SIM_PORTS fnSimPorts(-1)
#else
    #define _SIM_PORTS
#endif

#define ROWLEY_2                                                         // enable when working with Rowley Crossworks 2

#ifdef EK_LM3S9B95
    #define _LM3S9B95
    #define CRYSTAL_FREQ        8000000
    #define PLL_OUTPUT_FREQ     100000000                                // highest speed possible
    #define PART_CODE           CODE_LM3S9B95
    #define PIN_COUNT           PIN_COUNT_100_PIN
    #define PACKAGE_TYPE        PACKAGE_LQFP
#elif defined DK_LM3S9B96                                                // {30}
    #define _LM3S9B96
    #define CRYSTAL_FREQ        16000000
    #define PLL_OUTPUT_FREQ     80000000                                 // highest speed possible
    #define PART_CODE           CODE_LM3S9B96
    #define PIN_COUNT           PIN_COUNT_100_PIN
    #define PACKAGE_TYPE        PACKAGE_LQFP
#elif defined EK_LM3S9B90                                                // {19}
    #define _LM3S9B90
    #define CRYSTAL_FREQ        16000000
  //#define PLL_OUTPUT_FREQ     80000000                                 // highest speed possible
    #define PLL_OUTPUT_FREQ     50000000                                 // limited to 50MHz when FLASH writes are required due to errata - corrected from revision C devices
    #define PART_CODE           CODE_LM3S9B90
    #define PIN_COUNT           PIN_COUNT_100_PIN
    #define PACKAGE_TYPE        PACKAGE_LQFP
#elif defined EK_LM3S6965
    #define _LM3S6965
    #define CRYSTAL_FREQ        8000000
    #define PLL_OUTPUT_FREQ     50000000                                 // highest speed possible
    #define PART_CODE           CODE_LM3S6965
    #define PIN_COUNT           PIN_COUNT_100_PIN
    #define PACKAGE_TYPE        PACKAGE_LQFP
#elif defined EK_LM3S8962
    #define _LM3S8962
    #define CRYSTAL_FREQ        8000000
    #define PLL_OUTPUT_FREQ     50000000                                 // highest speed possible
    #define PART_CODE           CODE_LM3S8962
    #define PIN_COUNT           PIN_COUNT_100_PIN
    #define PACKAGE_TYPE        PACKAGE_LQFP
  //#define PIN_COUNT           PIN_COUNT_108_PIN                        // BGA
  //#define PACKAGE_TYPE        PACKAGE_BGA
#elif defined EK_LM3S1968
    #define _LM3S1968
    #define CRYSTAL_FREQ        8000000
    #define PLL_OUTPUT_FREQ     50000000                                 // highest speed possible
    #define PART_CODE           CODE_LM3S1968
    #define PIN_COUNT           PIN_COUNT_100_PIN
    #define PACKAGE_TYPE        PACKAGE_LQFP
#elif defined IDM_L35_B                                                  // {24}
    #define _LM3S1958
    #define CRYSTAL_FREQ        8000000
    #define PLL_OUTPUT_FREQ     50000000                                 // highest speed possible
    #define PART_CODE           CODE_LM3S1958
    #define PIN_COUNT           PIN_COUNT_100_PIN
    #define PACKAGE_TYPE        PACKAGE_LQFP
#elif defined _LM3S10X
  //#define _LM3S101
  //#define PART_CODE           CODE_LM3S101
    #define _LM3S102                                                     // with I2C
    #define PART_CODE           CODE_LM3S102
    #define PACKAGE_TYPE        PACKAGE_SOIC
    #define PIN_COUNT           PIN_COUNT_28_PIN
    #define CRYSTAL_FREQ        8000000
    #define PLL_OUTPUT_FREQ     20000000                                 // highest speed possible for this chip
#elif defined EK_LM3S5732                                                // {2}
    #define _LM3S5732
    #define CRYSTAL_FREQ        8000000
    #define PLL_OUTPUT_FREQ     50000000                                 // highest speed possible for this chip
    #define PART_CODE           CODE_LM3S5732
    #define PIN_COUNT           PIN_COUNT_64_PIN
    #define PACKAGE_TYPE        PACKAGE_LQFP
#elif defined EK_LM3S3748                                                // {2}
    #define _LM3S3748
    #define CRYSTAL_FREQ        8000000
    #define PLL_OUTPUT_FREQ     50000000                                 // highest speed possible for this chip
    #define PART_CODE           CODE_LM3S3748
    #define PIN_COUNT           PIN_COUNT_100_PIN
    #define PACKAGE_TYPE        PACKAGE_LQFP
    #define UART1_ON_PORT_C
#elif defined EK_LM3S3768                                                // {2}
    #define _LM3S3768
    #define CRYSTAL_FREQ        8000000
    #define PLL_OUTPUT_FREQ     50000000                                 // highest speed possible for this chip
    #define PART_CODE           CODE_LM3S3768
    #define PIN_COUNT           PIN_COUNT_100_PIN
    #define PACKAGE_TYPE        PACKAGE_LQFP
#elif defined EK_LM3S2110                                                // {4}
    #define _LM3S2110
    #define CRYSTAL_FREQ        8000000
    #define PLL_OUTPUT_FREQ     25000000                                 // highest speed possible for this chip
    #define PART_CODE           CODE_LM3S2110
    #define PIN_COUNT           PIN_COUNT_100_PIN
    #define PACKAGE_TYPE        PACKAGE_LQFP
#elif defined EK_LM3S2139                                                // {11}
    #define _LM3S2139
    #define CRYSTAL_FREQ        8000000
    #define PLL_OUTPUT_FREQ     25000000                                 // highest speed possible for this chip
    #define PART_CODE           CODE_LM3S2139
    #define PIN_COUNT           PIN_COUNT_100_PIN
    #define PACKAGE_TYPE        PACKAGE_LQFP
#else
                                                                         // other configurations can be added here
#endif

#include "../../Hardware/Luminary/LM3SXXXX.h"                            // {15}

// Memory set up for this target
//
#define BOOT_CODE_SIZE             0x800

