sWahlinRhoades/uTaskerModified/Applications/uTaskerV1.4/app_hw_lm3sxxxx.h
    #define SPI_FLASH_PAGE_LENGTH        SPI_FLASH_SUB_SECTOR_LENGTH     // for compatibility - smallest erasable block
    #define SPI_FLASH_BLOCK_LENGTH       SPI_FLASH_SUB_SECTOR_LENGTH     // for compatibility - file system granularity
#else
  //#define SPI_FLASH_AT45DB011                                          // {31} define the ATMEL type used here
  //#define SPI_FLASH_AT45DB021
  //#define SPI_FLASH_AT45DB041
    #define SPI_FLASH_AT45DB081
  //#define SPI_FLASH_AT45DB161
  //#define SPI_FLASH_AT45DB321
  //#define SPI_FLASH_AT45DB642
  //#define SPI_FLASH_AT45XXXXD_TYPE                                     // specify that a D-type rather than a B type is being used (only for the simulator)

    #if defined SPI_FLASH_AT45DB642                                      // define whether used in power of 2 mode or not
        #define SPI_FLASH_PAGE_LENGTH 1056                               // standard page size (B-device only allows 1056)
      //#define SPI_FLASH_PAGE_LENGTH 1024                               // size when power of 2 mode selected (only possible on D-device)
        #define SPI_FLASH_PAGES             (8*1024)                     // 8Meg part {23}
    #elif defined SPI_FLASH_AT45DB321 || defined SPI_FLASH_AT45DB161
        #define SPI_FLASH_PAGE_LENGTH 528                                // standard page size (B-device only allows 528)
      //#define SPI_FLASH_PAGE_LENGTH 512                                // size when power of 2 mode selected (only possible on D-device)
        #if defined SPI_FLASH_AT45DB161
            #define SPI_FLASH_PAGES         (4*1024)                     // 2Meg part {23}
        #else
            #define SPI_FLASH_PAGES         (8*1024)                     // 4Meg part {23}
        #endif
    #else
        #define SPI_FLASH_PAGE_LENGTH 264                                // standard page size (B-device only allows 264)
      //#define SPI_FLASH_PAGE_LENGTH 256                                // size when power of 2 mode selected (only possible on D-device)
        #if defined SPI_FLASH_AT45DB011
            #define SPI_FLASH_PAGES         (512)                        // 128k part
        #elif defined SPI_FLASH_AT45DB021
            #define SPI_FLASH_PAGES         (1024)                       // 256k part
        #elif defined SPI_FLASH_AT45DB041
            #define SPI_FLASH_PAGES         (2*1024)                     // 512k part
        #elif defined SPI_FLASH_AT45DB081
            #define SPI_FLASH_PAGES         (4*1024)                     // 1Meg part
        #endif
    #endif

    #define SPI_FLASH_BLOCK_LENGTH (8*SPI_FLASH_PAGE_LENGTH)             // block size - a block can be deleted
    #define SPI_FLASH_SECTOR_LENGTH (64*4*SPI_FLASH_PAGE_LENGTH)         // exception sector 0a is 2k and sector 0b is 62k
#endif
#define SPI_DATA_FLASH_0_SIZE       (SPI_FLASH_PAGES*SPI_FLASH_PAGE_LENGTH) 
#define SPI_DATA_FLASH_1_SIZE       SPI_DATA_FLASH_0_SIZE 
#define SPI_DATA_FLASH_2_SIZE       SPI_DATA_FLASH_0_SIZE
#ifdef SPI_FLASH_MULTIPLE_CHIPS
    #define SPI_FLASH_DEVICE_COUNT  3                                    // only define CS_LINE for this amount of devices
    #if SPI_FLASH_DEVICE_COUNT > 2                                       // {25}
        #define SPI_DATA_FLASH_SIZE   (SPI_DATA_FLASH_0_SIZE + SPI_DATA_FLASH_1_SIZE + SPI_DATA_FLASH_2_SIZE)
        #define CONFIGURE_CS_LINES()  _CONFIG_DRIVE_PORT_OUTPUT_VALUE(A, (CS0_LINE | CS1_LINE | CS2_LINE), (CS0_LINE | CS1_LINE | CS2_LINE))
    #else
        #define SPI_DATA_FLASH_SIZE   (SPI_DATA_FLASH_0_SIZE + SPI_DATA_FLASH_1_SIZE)
        #define CONFIGURE_CS_LINES()  _CONFIG_DRIVE_PORT_OUTPUT_VALUE(A, (CS0_LINE | CS1_LINE), (CS0_LINE | CS1_LINE))
    #endif
#else
    #define SPI_DATA_FLASH_SIZE       SPI_DATA_FLASH_0_SIZE                                  
    #define CONFIGURE_CS_LINES()      _CONFIG_DRIVE_PORT_OUTPUT_VALUE(A, CS0_LINE, CS0_LINE);
#endif


#define SPI_FLASH_START        (FLASH_START_ADDRESS + SIZE_OF_FLASH)     // SPI FLASH starts immediately after FLASH

#define SW_UPLOAD_FILE()       (*ucIp_Data == 'H') && (*(ucIp_Data+1) == 'S') && (*(ucIp_Data+2) == '.')  && (fnSPI_Flash_available() != 0)

#define SET_SPI_FLASH_MODE()                                             // {7}
#define REMOVE_SPI_FLASH_MODE()

#ifdef SDCARD_SUPPORT                                                    // {22}
    #if defined EK_LM3S6965
        // Configure to suit SD card SPI mode at between 100k and 400k
        //
        #define SPI_CS1_0                  PORTD_BIT0
        #define INITIALISE_SPI_SD_INTERFACE() _CONFIG_PERIPHERAL(A, SSI0, 1, (PORTA_BIT2 | PORTA_BIT5), (PA2_SSI0Clk | PA5_SSI0Tx)); \
                                           _CONFIG_DRIVE_PORT_OUTPUT_VALUE(A, PORTA_BIT4, PORTA_BIT4); \
                                           _CONFIG_DRIVE_PORT_OUTPUT_VALUE(D, SPI_CS1_0, SPI_CS1_0); \
                                           SSICR1_0 = 0; SSICPSR_0 = 2; \
                                           SSICR0_0 = (FRS_FREESCALE_SPI | SSI_SPH | SSI_SPO | DSS_8_BIT | ((((MASTER_CLOCK/2 + 300000/2)/300000) - 1) << SSI_SCR_SHIFT));

        #define ENABLE_SPI_SD_OPERATION()  SSICR1_0 = SSI_SSE
        #define SET_SD_CARD_MODE()         _CONFIG_PERIPHERAL(A, SSI0, 1, (PORTA_BIT4), (PA4_SSI0Rx))
        // Set maximum speed
        //
        #define SET_SPI_SD_INTERFACE_FULL_SPEED() SSICR0_0 = (FRS_FREESCALE_SPI | SSI_SPH | SSI_SPO | DSS_8_BIT | ((((MASTER_CLOCK/2 + 12000000/2)/12000000) - 1) << SSI_SCR_SHIFT))
        #ifdef _WINDOWS
            #define WRITE_SPI_CMD(byte)    SSIDR_0 = (unsigned char)byte; SSIDR_0 = _fnSimSD_write((unsigned char)byte)
            #define WAIT_TRANSMISSON_END() while (SSISR_0 & SSI_BSY) { SSISR_0 &= ~SSI_BSY; }
        #else
            #define WRITE_SPI_CMD(byte)    SSIDR_0 = (unsigned char)byte
            #define WAIT_TRANSMISSON_END() while (SSISR_0 & SSI_BSY) {}
        #endif
        #define READ_SPI_DATA()            (unsigned char)SSIDR_0

        #define POWER_UP_SD_CARD()                                       // apply power to the SD card if appropriate
        #define POWER_DOWN_SD_CARD()                                     // remove power from SD card interface
        #define SET_SD_DI_CS_HIGH()        _SETBITS(D, SPI_CS1_0)        // force DI and CS lines high ready for the initialisation sequence
        #define SET_SD_CS_LOW()            _CLEARBITS(D, SPI_CS1_0)      // assert the CS line of the SD card to be read
        #define SET_SD_CS_HIGH()           _SETBITS(D, SPI_CS1_0)        // negate the CS line of the SD card to be read
    #elif defined EK_LM3S8962 
        // Configure to suit SD card SPI mode at between 100k and 400k
        //
        #define SPI_CS1_0                  PORTG_BIT0
        #define INITIALISE_SPI_SD_INTERFACE() _CONFIG_PERIPHERAL(A, SSI0, 1, (PORTA_BIT2 | PORTA_BIT5), (PA2_SSI0Clk | PA5_SSI0Tx)); \
                                           _CONFIG_DRIVE_PORT_OUTPUT_VALUE(A, PORTA_BIT4, PORTA_BIT4); \
                                           _CONFIG_DRIVE_PORT_OUTPUT_VALUE(G, SPI_CS1_0, SPI_CS1_0); \
                                           SSICR1_0 = 0; SSICPSR_0 = 2; \
                                           SSICR0_0 = (FRS_FREESCALE_SPI | SSI_SPH | SSI_SPO | DSS_8_BIT | ((((MASTER_CLOCK/2 + 300000/2)/300000) - 1) << SSI_SCR_SHIFT));

        #define ENABLE_SPI_SD_OPERATION()  SSICR1_0 = SSI_SSE
        #define SET_SD_CARD_MODE()         _CONFIG_PERIPHERAL(A, SSI0, 1, (PORTA_BIT4), (PA4_SSI0Rx))
        // Set maximum speed
        //
        #define SET_SPI_SD_INTERFACE_FULL_SPEED() SSICR0_0 = (FRS_FREESCALE_SPI | SSI_SPH | SSI_SPO | DSS_8_BIT | ((((MASTER_CLOCK/2 + 6000000/2)/600000) - 1) << SSI_SCR_SHIFT))
        #ifdef _WINDOWS
            #define WRITE_SPI_CMD(byte)    SSIDR_0 = (unsigned char)byte; SSIDR_0 = _fnSimSD_write((unsigned char)byte)
            #define WAIT_TRANSMISSON_END() while (SSISR_0 & SSI_BSY) { SSISR_0 &= ~SSI_BSY; }
        #else
            #define WRITE_SPI_CMD(byte)    SSIDR_0 = (unsigned char)byte
            #define WAIT_TRANSMISSON_END() while (SSISR_0 & SSI_BSY) {}
        #endif
        #define READ_SPI_DATA()            (unsigned char)SSIDR_0

        #define POWER_UP_SD_CARD()                                       // apply power to the SD card if appropriate
        #define POWER_DOWN_SD_CARD()                                     // remove power from SD card interface
        #define SET_SD_DI_CS_HIGH()        _SETBITS(G, SPI_CS1_0)        // force DI and CS lines high ready for the initialisation sequence
        #define SET_SD_CS_LOW()            _CLEARBITS(G, SPI_CS1_0)      // assert the CS line of the SD card to be read
        #define SET_SD_CS_HIGH()           _SETBITS(G, SPI_CS1_0)        // negate the CS line of the SD card to be read
    #elif defined EK_LM3S3748
        // Configure to suit SD card SPI mode at between 100k and 400k
        //
        #define SPI_CS1_0                  PORTA_BIT3
        #define INITIALISE_SPI_SD_INTERFACE() _CONFIG_PERIPHERAL(A, SSI0, 1, (PORTA_BIT2 | PORTA_BIT5), (PA2_SSI0Clk | PA5_SSI0Tx)); \
                                           _CONFIG_DRIVE_PORT_OUTPUT_VALUE(A, PORTA_BIT4, PORTA_BIT4); \
                                           _CONFIG_DRIVE_PORT_OUTPUT_VALUE(A, SPI_CS1_0, SPI_CS1_0); \
                                           SSICR1_0 = 0; SSICPSR_0 = 2; \
                                           SSICR0_0 = (FRS_FREESCALE_SPI | SSI_SPH | SSI_SPO | DSS_8_BIT | ((((MASTER_CLOCK/2 + 300000/2)/300000) - 1) << SSI_SCR_SHIFT));

        #define ENABLE_SPI_SD_OPERATION()  SSICR1_0 = SSI_SSE
        #define SET_SD_CARD_MODE()         _CONFIG_PERIPHERAL(A, SSI0, 1, (PORTA_BIT4), (PA4_SSI0Rx))
        // Set maximum speed
        //
        #define SET_SPI_SD_INTERFACE_FULL_SPEED() SSICR0_0 = (FRS_FREESCALE_SPI | SSI_SPH | SSI_SPO | DSS_8_BIT | ((((MASTER_CLOCK/2 + 6000000/2)/600000) - 1) << SSI_SCR_SHIFT))
        #ifdef _WINDOWS
            #define WRITE_SPI_CMD(byte)    SSIDR_0 = (unsigned char)byte; SSIDR_0 = _fnSimSD_write((unsigned char)byte)
            #define WAIT_TRANSMISSON_END() while (SSISR_0 & SSI_BSY) { SSISR_0 &= ~SSI_BSY; }
        #else
            #define WRITE_SPI_CMD(byte)    SSIDR_0 = (unsigned char)byte
            #define WAIT_TRANSMISSON_END() while (SSISR_0 & SSI_BSY) {}
        #endif
        #define READ_SPI_DATA()            (unsigned char)SSIDR_0

        #define POWER_UP_SD_CARD()                                       // apply power to the SD card if appropriate
        #define POWER_DOWN_SD_CARD()                                     // remove power from SD card interface
        #define SET_SD_DI_CS_HIGH()        _SETBITS(A, SPI_CS1_0)        // force DI and CS lines high ready for the initialisation sequence
        #define SET_SD_CS_LOW()            _CLEARBITS(A, SPI_CS1_0)      // assert the CS line of the SD card to be read
        #define SET_SD_CS_HIGH()           _SETBITS(A, SPI_CS1_0)        // negate the CS line of the SD card to be read
        #define GET_SDCARD_WP_STATE()      0
    #elif defined IDM_L35_B
        // Configure to suit SD card SPI mode at between 100k and 400k
        //
        #define SPI_CS1_1                  PORTE_BIT1
        #define INITIALISE_SPI_SD_INTERFACE() RCGC2 |= CGC_GPIOE; GPIOAFSEL_E = 0; \
                                           _CONFIG_PERIPHERAL(E, SSI1, 1, (PORTE_BIT0 | PORTE_BIT3), (PE0_SSI1Clk | PE3_SSI1Tx)); \
                                           _CONFIG_DRIVE_PORT_OUTPUT_VALUE(E, PORTA_BIT2, PORTA_BIT2); \
                                           _CONFIG_DRIVE_PORT_OUTPUT_VALUE(E, SPI_CS1_1, SPI_CS1_1); \
                                           SSICR1_1 = 0; SSICPSR_1 = 2; \
                                           SSICR0_1 = (FRS_FREESCALE_SPI | SSI_SPH | SSI_SPO | DSS_8_BIT | ((((MASTER_CLOCK/2 + 300000/2)/300000) - 1) << SSI_SCR_SHIFT));

        #define ENABLE_SPI_SD_OPERATION()  SSICR1_1 = SSI_SSE
        #define SET_SD_CARD_MODE()         _CONFIG_PORT_PULLUP(E, PORTE_BIT2); _CONFIG_PERIPHERAL(E, SSI1, 1, (PORTE_BIT2), (PE2_SSI1Rx))
        // Set maximum speed
        //
        #define SET_SPI_SD_INTERFACE_FULL_SPEED() SSICR0_1 = (FRS_FREESCALE_SPI | SSI_SPH | SSI_SPO | DSS_8_BIT | ((((MASTER_CLOCK/2 + 12000000/2)/12000000) - 1) << SSI_SCR_SHIFT))
        #ifdef _WINDOWS
            #define WRITE_SPI_CMD(byte)    SSIDR_1 = (unsigned char)byte; SSIDR_1 = _fnSimSD_write((unsigned char)byte)
            #define WAIT_TRANSMISSON_END() while (SSISR_1 & SSI_BSY) { SSISR_1 &= ~SSI_BSY; }
        #else
            #define WRITE_SPI_CMD(byte)    SSIDR_1 = (unsigned char)byte
            #define WAIT_TRANSMISSON_END() while (SSISR_1 & SSI_BSY) {}
        #endif
        #define READ_SPI_DATA()            (unsigned char)SSIDR_1

        #define POWER_UP_SD_CARD()                                       // apply power to the SD card if appropriate
        #define POWER_DOWN_SD_CARD()                                     // remove power from SD card interface
        #define SET_SD_DI_CS_HIGH()        _SETBITS(E, SPI_CS1_1)        // force DI and CS lines high ready for the initialisation sequence
        #define SET_SD_CS_LOW()            _CLEARBITS(E, SPI_CS1_1)      // assert the CS line of the SD card to be read
        #define SET_SD_CS_HIGH()           _SETBITS(E, SPI_CS1_1)        // negate the CS line of the SD card to be read
    #endif
#endif

