sWahlinRhoades/uTaskerModified/Applications/uTaskerV1.4/app_hw_lm3sxxxx.h
// FLASH based File System setup
//
#if defined FLASH_FILE_SYSTEM
    #if defined SPI_FILE_SYSTEM                                          // this is a test setup for external SPI FLASH, with the parameters at the end of internal FLASH
        #define uFILE_START (SPI_FLASH_START)                            // FLASH location end of internal FLASH
        #define PARAMETER_BLOCK_START (SPI_FLASH_START - PAR_BLOCK_SIZE) // FLASH location at 2 parameter blocks short of end of internal FLASH
        #define SINGLE_FILE_SIZE (FILE_GRANULARITY)                      // each file a multiple of 16k (Atmel/ST data FLASH)/64k ST code FLASH
        #if SINGLE_FILE_SIZE < 20000                                     // {36}
            #if SPI_DATA_FLASH_SIZE < (64*SINGLE_FILE_SIZE)              // {42} allow testing smallest SPI FLASH
                #define FILE_SYSTEM_SIZE  SPI_DATA_FLASH_SIZE
            #else
                #define FILE_SYSTEM_SIZE (32*SINGLE_FILE_SIZE)           // 1Meg reserved for file system (assuming 8k file size) {34} [PAR_BLOCK_SIZE removed]
            #endif
        #else
            #define FILE_SYSTEM_SIZE (16*SINGLE_FILE_SIZE)               // 1Meg reserved for file system {35}
        #endif
    #else
        #define FILE_GRANULARITY (1 * FLASH_GRANULARITY)                 // each file a multiple of 1k
        #if defined _TEMPEST_CLASS                                       // {21}
            #define PARAMETER_BLOCK_START 0x17000                        // FLASH location at 92k start
            #define uFILE_START 0x19000                                  // FLASH location at 100k start

            #define SINGLE_FILE_SIZE (4*FLASH_GRANULARITY)               // each file a multiple of 4k to ensure that files are made of 4 x 1k sectors to avoid problems with neighbours
            #define FILE_SYSTEM_SIZE (39*SINGLE_FILE_SIZE)               // 156k reserved for file system
        #else
            #define PARAMETER_BLOCK_START 0x18000                        // {34} FLASH location at 96k start
            #define uFILE_START 0x19000                                  // FLASH location at 100k start

            #define SINGLE_FILE_SIZE (1*FLASH_GRANULARITY)               // each file a multiple of 1k
            #define FILE_SYSTEM_SIZE (156*SINGLE_FILE_SIZE)              // 156k reserved for file system
        #endif
    #endif
#endif

#ifdef USE_PARAMETER_BLOCK
    #if defined _TEMPEST_CLASS                                           // {21}
        #define PARAMETER_BLOCK_SIZE    (4*FLASH_GRANULARITY)            // use 4k parameter block
    #else
        #define PARAMETER_BLOCK_SIZE    (2*FLASH_GRANULARITY)            // use 2k parameter block (made up of two sectors)
    #endif

    #ifdef USE_PAR_SWAP_BLOCK
        #define PAR_BLOCK_SIZE      (2*PARAMETER_BLOCK_SIZE)
    #else
        #define PAR_BLOCK_SIZE      (1*PARAMETER_BLOCK_SIZE)
    #endif
#else
    #define PAR_BLOCK_SIZE          (0)
#endif


#define USB_DOWNLOAD_FILE           "0"                                  // USB firmware uploads are saved here

#define USB_BUS_SWITCH                                                   // control USB bus power using USB0EPE and USB0PFLT

// Serial interfaces
//
#ifdef SERIAL_INTERFACE
    #define WELCOME_MESSAGE_UART   "\r\n\nHello, world... LM3Sxxxx\r\n"
    #define EXT_UART_SC16IS7XX                                           // {26} use an external SPI based UART to extend the number of channels
    #define NUMBER_EXTERNAL_SERIAL   2                                   // {18}
    #define NUMBER_SERIAL  CHIP_HAS_UARTS                                // the number of physical queue needed for serial interface(s)
    #define SIM_COM_EXTENDED                                             // COM ports defined from 1..255
    #define SERIAL_PORT_0  3                                             // if we open UART channel 0 we simulate using this com port on the PC (0 for no mapping)
    #define SERIAL_PORT_1  4                                             // if we open UART channel 1 we simulate using this com port on the PC
    #define SERIAL_PORT_2  15                                            // if we open UART channel 2 we simulate using this com port on the PC
    #define SERIAL_PORT_EXT_0  3                                         // if we open UART channel 3 we simulate using this com port on the PC
    #define SERIAL_PORT_EXT_1  11                                        // if we open UART channel 4 we simulate using this com port on the PC

    #if defined _LM3S3748
        #define SERIAL_SUPPORT_DMA                                       // enable UART DMA support (only available on some processors - ensure that the linker script used keeps the start of SRAM [512 or 1024 bytes] free)
    #endif
    #define SUPPORT_HW_FLOW                                              // enable hardware flow control support

    #define DEMO_UART        3                                           // use UART 4 (second external)
  //#define PPP_UART         1                                           // use UART 1 for PPP
    #define MODBUS_UART_0    4
    #define MODBUS_UART_1    1
    #define MODBUS_UART_2    2
    #define TX_BUFFER_SIZE   (256)                                       // the size of RS232 input and output buffers
    #define RX_BUFFER_SIZE   (64)

    #if defined SUPPORT_HW_FLOW                                          // define the ports for RTS/CTS use
        #define RTS_0_PORT         GPIODATA_D
        #define RTS_0_PIN          PORTD_BIT1
        #define RTS_0_PORT_POWER   CGC_GPIOD
        #define RTS_0_PORT_ENABLE  GPIODEN_D
        #define RTS_0_PORT_DDR     GPIODIR_D

        #define RTS_1_PORT         GPIODATA_D
        #define RTS_1_PIN          PORTD_BIT0
        #define RTS_1_PORT_POWER   CGC_GPIOD
        #define RTS_1_PORT_ENABLE  GPIODEN_D
        #define RTS_1_PORT_DDR     GPIODIR_D

        #define RTS_2_PORT         GPIODATA_A
      //#define RTS_2_PIN          PORTA_BIT2
        #define RTS_2_PORT_POWER   CGC_GPIOA
        #define RTS_2_PORT_ENABLE  GPIODEN_A
        #define RTS_2_PORT_DDR     GPIODIR_A

        #define CTS_0_PIN          PORTA_BIT3
        #define CTS_0_PORT_POWER   CGC_GPIOA
        #define CTS_0_PORT_ENABLE  GPIODEN_A
        #define CTS_0_PORT_DDR     GPIODIR_A
        #define CTS_0_PORT         PORTA
        #define CTS_0_INT_PRIORITY 3

        #define CTS_1_PIN          PORTA_BIT7
        #define CTS_1_PORT_POWER   CGC_GPIOA
        #define CTS_1_PORT_ENABLE  GPIODEN_A
        #define CTS_1_PORT_DDR     GPIODIR_A
        #define CTS_1_PORT         PORTA
        #define CTS_1_INT_PRIORITY 3

