sWahlinRhoades/uTaskerModified/Applications/uTaskerV1.4/app_hw_lm3sxxxx.h
        #define CTS_2_PIN          PORTA_BIT6
        #define CTS_2_PORT_POWER   CGC_GPIOA
        #define CTS_2_PORT_ENABLE  GPIODEN_A
        #define CTS_2_PORT_DDR     GPIODIR_A
        #define CTS_2_PORT         PORTA
        #define CTS_2_INT_PRIORITY 3
    #endif

    // External SPI based UART configuration                             {26}
    //
    #define SC16IS7XX_CLOCK_FROM_TIMER                                   // generate the clock from a timer (the clock is generates in fnUserHWInit() and a port holds the device in reset until configuration begins)
    #define CONFIG_SC16IS7XX_CLOCK()             _CONFIG_DRIVE_PORT_OUTPUT_VALUE(A, PORTA_BIT0, 0); \
                                                 RCGC1 |= (CGC_TIMER0); SRCR1 &= ~(CGC_TIMER0); \
                                                 GPTMCFG_0 = GPTMCFG_16_BIT_MODE; \
                                                 _CONFIG_PERIPHERAL(D, TIMER0, 1, (PORTD_BIT7), PD7_CCP1); \
                                                 GPTMTBMR_0 = (TAMS_PWM_MODE | TMR_PERIODIC); \
                                                 GPTMTBMATCHR_0 = (26/2); GPTMTBILR_0 = 26; \
                                                 GPTMCTL_0 |= (TBEN | TBPWML);

    #define SC16IS7XX_CS                         PORTA_BIT3
    #define CONFIGURE_SPI_FOR_SC16IS7XX()        _CONFIG_PERIPHERAL(A, SSI0, 1, (PORTA_BIT2 | PORTA_BIT5 | PORTA_BIT4), (PA2_SSI0Clk | PA5_SSI0Tx | PA4_SSI0Rx)); \
                                                 _CONFIG_DRIVE_PORT_OUTPUT_VALUE(A, SC16IS7XX_CS, SC16IS7XX_CS); \
                                                 SSICR1_0 = 0; SSICPSR_0 = 2; \
                                                 SSICR0_0 = (FRS_FREESCALE_SPI | SSI_SPH | SSI_SPO | DSS_8_BIT | ((((MASTER_CLOCK/2 + 1000000/2)/1000000) - 1) << SSI_SCR_SHIFT)); \
                                                 SSICR1_0 = SSI_SSE; \
                                                 _SETBITS(A, PORTA_BIT0);

  //#define SC16IS7XX_CLOCK                      14745600                // clock rate of the external SC16IS7XX devices
    #define SC16IS7XX_CLOCK                     (PLL_OUTPUT_FREQ/27)     // timer clock speed (1.852MHz)

    #define ENABLE_CHIP_SELECT_SC16IS7XX_0()     _CLEARBITS(A, PORTA_BIT3)
    #define DISABLE_CHIP_SELECTS_SC16IS7XX()     _SETBITS(A, PORTA_BIT3)
    #define SC16IS7XX_SPI_TDR                    SSIDR_0
    #define SC16IS7XX_SPI_RDR                    SSIDR_0
    #define SC16IS7XX_SPI_SR                     SSISR_0
    #define EXT_UART_0_1_INT_PORT                PORTA
    #define EXT_UART_0_1_INT_BIT                 PORTA_BIT1
    #define CHECK_UART_0_1_INT_PENDING()         _READ_PORT_MASK(A, PORT_BIT1)

    #define PRIORITY_IRQ                         PORTA_INTERRUPT_PRIORITY
#else
    #define TX_BUFFER_SIZE   (256)
    #define RX_BUFFER_SIZE   (256)
#endif

#define SUPPORT_ADC                                                      // {8}
#ifdef SUPPORT_ADC
    #define ADC_SIM_STEP_SIZE                      (200  * ADC_FULL_SCALE) // 200mV steps when simulating

    #define AN0_START_VOLTAGE                      (33   * ADC_FULL_SCALE) // initial voltages when simulating (mV)
    #define AN1_START_VOLTAGE                      (500  * ADC_FULL_SCALE)
    #define AN2_START_VOLTAGE                      (1000 * ADC_FULL_SCALE)
    #define AN3_START_VOLTAGE                      (1500 * ADC_FULL_SCALE)
    #define AN4_START_VOLTAGE                      (2100 * ADC_FULL_SCALE)
    #define AN5_START_VOLTAGE                      (2400 * ADC_FULL_SCALE)
    #define AN6_START_VOLTAGE                      (2700 * ADC_FULL_SCALE)
    #define AN7_START_VOLTAGE                      (3000 * ADC_FULL_SCALE)
    #if (PART_DC1 & ADC1_PRESENT1)                                       // second ADC - assume 16 ADC inputs available
        #define AN8_START_VOLTAGE                  (55 * ADC_FULL_SCALE) // initial voltages when simulating (mV)
        #define AN9_START_VOLTAGE                  (82 * ADC_FULL_SCALE)
        #define AN10_START_VOLTAGE                 (102 * ADC_FULL_SCALE)
        #define AN11_START_VOLTAGE                 (235 * ADC_FULL_SCALE)
        #define AN12_START_VOLTAGE                 (789 * ADC_FULL_SCALE)
        #define AN13_START_VOLTAGE                 (1099 * ADC_FULL_SCALE)
        #define AN14_START_VOLTAGE                 (2087 * ADC_FULL_SCALE)
        #define AN15_START_VOLTAGE                 (2567 * ADC_FULL_SCALE)
    #endif
#endif

#define SUPPORT_TIMER                                                  // {5} support hardware timer interrupt configuration
#if defined MODBUS_RTU && !defined SUPPORT_TIMER
    #define SUPPORT_TIMER                                                // MODBUS required HW timer in RTU mode
#endif

#define _TIMER_INTERRUPT_SETUP  TIMER_INTERRUPT_SETUP

#define MODBUS_TIMER_16BIT                                               // {27}

#ifdef MODBUS_TIMER_16BIT
    #define MODBUS0_TIMER_CHANNEL    0                                   // MODBUS serial port 0 uses timer 0 (16 bit mode)
    #define MODBUS0_TIMER_MODE       (TIMER_SINGLE_SHOT | TIMER_US_VALUE | TIMER_16BIT_CHANNEL_A); // channel A
    #define MODBUS1_TIMER_CHANNEL    0                                   // MODBUS serial port 1 uses timer 0 (16 bit mode)
    #define MODBUS1_TIMER_MODE       (TIMER_SINGLE_SHOT | TIMER_US_VALUE | TIMER_16BIT_CHANNEL_B); // channel B
#else
    #define MODBUS0_TIMER_CHANNEL    0                                   // {5} MODBUS serial port 0 uses timer 0 (32 bit mode)
    #define MODBUS1_TIMER_CHANNEL    1                                   // MODBUS serial port 1 uses timer 1 (32 bit mode)
#endif


#define SUPPORT_PORT_INTERRUPTS                                          // support code for port interrupts
#ifdef SUPPORT_PORT_INTERRUPTS
    #define SUPPORT_PORT_A_INTERRUPTS                                    // specifically support interrupts on this port
    #define SUPPORT_PORT_B_INTERRUPTS                                    // specifically support interrupts on this port
    #define SUPPORT_PORT_C_INTERRUPTS                                    // specifically support interrupts on this port
    #define SUPPORT_PORT_D_INTERRUPTS                                    // specifically support interrupts on this port
    #define SUPPORT_PORT_E_INTERRUPTS                                    // specifically support interrupts on this port
    #define SUPPORT_PORT_F_INTERRUPTS                                    // specifically support interrupts on this port
    #define SUPPORT_PORT_G_INTERRUPTS                                    // specifically support interrupts on this port
    #define SUPPORT_PORT_H_INTERRUPTS                                    // specifically support interrupts on this port
    #define SUPPORT_PORT_J_INTERRUPTS                                    // specifically support interrupts on this port
#endif

#define SUPPORT_PWM_CONTROLLER                                           // {28} support PWM controller

#define TICK_INTERRUPT()                                                 // {19} user callback from system TICK

