sWahlinRhoades/uTaskerModified/Applications/uTaskerV1.4/app_hw_lm3sxxxx.h
                                                                         // {29}
#define INITIALISE_MONITOR_TIMER() 
#define EXECUTION_DURATION()  0


// I2C Interface
//
#if defined I2C_INTERFACE
    #define OUR_I2C_CHANNEL         0                                    // use I2C0 for demo
    #define NUMBER_I2C              CHIP_HAS_I2C                         // I2C channels available
#endif

#define USER_REG0_VALUE             0x00b61a00                           // MAC address in user registers (00-1a-b6-00-22-1d)
#define USER_REG1_VALUE             0x001d2200
#define USER_REG2_VALUE             0xffffffff                           // Tempest class
#define USER_REG3_VALUE             0xffffffff                           // Tempest class

// LAN interface
//
#ifdef ETH_INTERFACE
    #define MAC_FROM_USER_REG                                            // use MAC address programmed in the user register
  //#define LAN_REPORT_ACTIVITY                                          // transmissions/receptions and errors are reported to chosen task (for link LED control, etc)

    #ifdef LAN_REPORT_ACTIVITY                                           // {20}
        #define LNKLED                 PORTH_BIT1
        #define ACTLED                 PORTH_BIT2
        #define SPDLED                 PORTH_BIT3
        #define DUPLED                 PORTH_BIT4
        #define COLLED                 PORTH_BIT5
        #define ACTIVITY_LED_OFF()     _CLEARBITS(H, ACTLED)
        #define ACTIVITY_LED_ON()      _SETBITS(H, ACTLED)
        #define TURN_LINK_LED_ON()     _SETBITS(H, LNKLED)
        #define SPEED_LED_ON()         _SETBITS(H, (SPDLED | LNKLED))
        #define SPEED_LED_OFF()        _CLEARBITS(H, (SPDLED | LNKLED))
        #define LINK_DOWN_LEDS()       _CLEARBITS(H, (LNKLED | ACTLED | COLLED | SPDLED | DUPLED))

        #define CONFIGURE_LAN_LEDS()   _CONFIG_DRIVE_PORT_OUTPUT_VALUE(H, (LNKLED | ACTLED | COLLED | SPDLED | DUPLED), 0)
    #endif

    #define NUMBER_OF_TX_BUFFERS_IN_ETHERNET_DEVICE 1
    #define NUMBER_OF_RX_BUFFERS_IN_ETHERNET_DEVICE 4
#endif

#ifdef USE_IP
    #define LAN_BUFFER_SIZE           1536                               // LM3Sxxxx has ample space for full tx buffer
#else
    #define LAN_BUFFER_SIZE           256                                // if using Ethernet without IP the buffer size can be set here
#endif

#ifdef USE_BUFFERED_TCP                                                  // if using a buffer for TCP to allow interractive data applications (like TELNET)
    #define TCP_BUFFER                2800                               // size of TCP buffer (with USE_BUFFERED_TCP) - generous with LM3Sxxxx
    #define TCP_BUFFER_FRAME          1400                               // allow this max. TCP frame size
#endif

#ifdef USE_HTTP
    #define HTTP_BUFFER_LENGTH        1400                               // we send frames with this maximum amount of payload data - generous with LM3Sxxxx
#endif

#ifdef USE_FTP                                                           // specify FTP support details
    #define FTP_WELCOME_RESPONSE         "220 Welcome LM3Sxxxx FTP.\r\n"
    //                                        ^^^^^^^^^^^^^^^^^^            customise the FTP welcome here
#endif

// SMTP settings
//
#if defined EK_LM3S9B95
    #define SENDERS_EMAIL_ADDRESS             "EK_LM3S9B95@uTasker.com"  // fictional Email address of the board being used
    #define EMAIL_SUBJECT                     "EK_LM3S9B95 Test"         // Email subject
    #define EMAIL_CONTENT                     "Hello!!\r\nThis is an email message from the EK_LM3S9B95.\r\nI hope that you have received this test and have fun using the uTasker operating system with integrated TCP/IP stack.\r\r\nRegards your EK_LM3S9B95!!";
#elif defined DK_LM3S9B96                                                // {30}
    #define SENDERS_EMAIL_ADDRESS             "DK_LM3S9B96@uTasker.com"  // fictional Email address of the board being used
    #define EMAIL_SUBJECT                     "DK_LM3S9B96 Test"         // Email subject
    #define EMAIL_CONTENT                     "Hello!!\r\nThis is an email message from the DK_LM3S9B96.\r\nI hope that you have received this test and have fun using the uTasker operating system with integrated TCP/IP stack.\r\r\nRegards your DK_LM3S9B96!!";
#elif defined EK_LM3S9B90
    #define SENDERS_EMAIL_ADDRESS             "EK_LM3S9B90@uTasker.com"  // fictional Email address of the board being used
    #define EMAIL_SUBJECT                     "EK_LM3S9B90 Test"         // Email subject
    #define EMAIL_CONTENT                     "Hello!!\r\nThis is an email message from the EK_LM3S9B90.\r\nI hope that you have received this test and have fun using the uTasker operating system with integrated TCP/IP stack.\r\r\nRegards your EK_LM3S9B90!!";
#elif defined EK_LM3S6965
    #define SENDERS_EMAIL_ADDRESS             "EK_LM3S6965@uTasker.com"  // fictional Email address of the board being used
    #define EMAIL_SUBJECT                     "EK_LM3S6965 Test"         // Email subject
    #define EMAIL_CONTENT                     "Hello!!\r\nThis is an email message from the EK_LM3S6965.\r\nI hope that you have received this test and have fun using the uTasker operating system with integrated TCP/IP stack.\r\r\nRegards your EK_LM3S6965!!";
#elif defined EK_LM3S8962
    #define SENDERS_EMAIL_ADDRESS             "EK_LM3S8962@uTasker.com"  // fictional Email address of the board being used
    #define EMAIL_SUBJECT                     "EK_LM3S8962 Test"         // Email subject
    #define EMAIL_CONTENT                     "Hello!!\r\nThis is an email message from the EK_LM3S8962.\r\nI hope that you have received this test and have fun using the uTasker operating system with integrated TCP/IP stack.\r\r\nRegards your EK_LM3S8962!!";
#endif

// internal HTML message pages
//
#define SUPPORT_INTERNAL_HTML_FILES                                      // enable the use of the following files
#define UPLOAD_FAILED         "<html><head><title>SW Upload failed</title></head><body bgcolor=#ff9000 text=#000000 topmargin=3 marginheight=3><center><td valign=top class=h><font color=#ff0000 style=font-size:30px><b style='mso-bidi-font-weight:normal'>&micro;Tasker</font></i></b></td><br></td><td align=left><br><br>Sorry but upload has failed.</font><br><br><a href=""javascript:history.back()"">Return</a></body></html>"
#define SW_UPLOAD_COMPLETED   "<html><head><meta http-equiv=""refresh"" content=""10;URL=0Menu.htm""><title>LM3SXXXX SW Uploaded</title></head><body bgcolor=#ffffff text=#000000 topmargin=3 marginheight=3><center><td valign=top class=h><font color=#ff0000 style=font-size:30px><b style='mso-bidi-font-weight:normal'>&micro;Tasker</font> - SW Update</i></b></td><br></td><td align=left><br><br>SW Upload successful. The LM3SXXXX target will now reset and start the new program. Please wait 10s...</body></html>"
#ifdef USE_TFTP
    #define TFTP_ERROR_MESSAGE               "uTasker TFTP Error"        // Fixed TFTP error test
#endif

