sWahlinRhoades/uTaskerModified/Applications/uTaskerV1.4/app_hw_lm3sxxxx.h
// Global Hardware Timer setup
//
#if defined GLOBAL_TIMER_TASK
    #define MILLISEC               LOW_RES_MS                            // 1ms about 2% accurate ms values, 22us resolution and limit of about 1.42s max. It uses a 16 bit timer at bus/1024 frequency
  //#define MILLISEC               MED_RES_MS                            // 1ms about 0.2% accurate ms values, 3us resolution and limit of about 177ms max. It uses a 16 bit timer at bus/128 frequency
  //#define MILLISEC               HIGH_RES_MS                           // 1ms about 0.05% accurate ms values, 1us resolution and limit of about 44ms max. It uses a 16 bit timer at bus/32 frequency
#endif

// Define interrupt priorities in the system
//
#define SYSTICK_PRIORITY           7                                     // {1}

#define PRIORITY_UART0             6
#define PRIORITY_UART1             6
#define PRIORITY_UART2             6
#define PORTA_INTERRUPT_PRIORITY   5
#define PRIORITY_HW_TIMER          5
#define PRIORITY_TIMERS            5
#define PRIORITY_USB_OTG           4
#define PRIORITY_I2C0              4
#define PRIORITY_I2C1              4
#define PRIORITY_TWI               4
#define PRIORITY_TICK_TIMER        3
#define PRIORITY_ADC               2
#define PORTB_INTERRUPT_PRIORITY   2                                     // default if PB4 ADC trigger configured
#define PRIORITY_EMAC              1


#if defined EK_LM3S6965 || defined EK_LM3S8962 || defined EK_LM3S9B95 || defined DK_LM3S9B96
    #define DEMO_LED_1                 PORTF_BIT0
    #define DEMO_LED_2                 PORTF_BIT1
    #define DEMO_LED_3                 PORTF_BIT2
    #define DEMO_LED_4                 PORTF_BIT3
    #define DEMO_USER_PORTS            (DEMO_LED_1 | DEMO_LED_2 | DEMO_LED_3 | DEMO_LED_4)

    #define BLINK_LED                  DEMO_LED_1
    #define DEMO_DIGITAL_ENABLE        GPIODEN_F
    #define DEMO_LED_DDR               GPIODIR_F
    #define DEMO_LED_PORT              GPIODATA_F
    #ifdef USE_MAINTENANCE
        #define ENABLE_LED_PORT()      RCGC2 |= CGC_GPIOF; SRCR2 &= ~CGC_GPIOF; // clock port and ensure not in reset
    #else
        #define ENABLE_LED_PORT()      RCGC2 |= CGC_GPIOF; SRCR2 &= ~CGC_GPIOF; DEMO_DIGITAL_ENABLE = BLINK_LED; DEMO_LED_DDR = BLINK_LED; // clock port and ensure not in reset
    #endif
    #define MEASURE_LOW_POWER_ON()     
    #define MEASURE_LOW_POWER_OFF()

    #define TOGGLE_WATCHDOG_LED()      _TOGGLE_PORT(F, BLINK_LED)        // blink the LED, if set as output

    #if defined SUPPORT_OLED || defined OLED_GLCD_MODE                   // {10}{14} 128 x 96 OLED 
        #if defined EK_LM3S6965
            #define ACTIVATE_OLED_POWER()  _CONFIG_DRIVE_PORT_OUTPUT_VALUE(C, PORTC_BIT6, PORTC_BIT6); // power OLDE
            #define CONFIGURE_OLED_DC()    _CONFIG_DRIVE_PORT_OUTPUT_VALUE(C, PORTC_BIT7, PORTC_BIT7); // DC pin
            #define OLED_DC_L()            _CLEARBITS(C, PORTC_BIT7)
            #define OLED_DC_H()            _SETBITS(C, PORTC_BIT7)
            #undef  GLCD_Y
            #undef  LCD_PIXEL_COLOUR                                     // smaller, yellow OLED on this board
            #define GLCD_Y                 64                            // vertical resolution of the OLED display in pixels
            #define LCD_PIXEL_COLOUR       (COLORREF)RGB(255,255,0)
            #undef  BIG_PIXEL
            #define SPI_SPEED              500000
        #else
            #define ACTIVATE_OLED_POWER()  _CONFIG_DRIVE_PORT_OUTPUT_VALUE(A, PORTA_BIT7, PORTA_BIT7); // power OLED
            #define CONFIGURE_OLED_DC()    _CONFIG_DRIVE_PORT_OUTPUT_VALUE(A, PORTA_BIT6, PORTA_BIT6); // DC pin
            #define OLED_DC_L()            _CLEARBITS(A, PORTA_BIT6)
            #define OLED_DC_H()            _SETBITS(A, PORTA_BIT6)
            #define SPI_SPEED              1000000
        #endif

        // configure SSI0 peripheral lines, ensure SPI disabled (master mode). FSS automatically controls the CS line
        // set clock prescaler (even prescale 2..254) 
        // configure SPI mode at 1MHz and final enable for operation
        #define CONFIGURE_SPI()        _CONFIG_PERIPHERAL(A, SSI0, 1, (PORTA_BIT2 | PORTA_BIT3 | PORTA_BIT5), (PA2_SSI0Clk | PA5_SSI0Tx | PA3_SSI0Fss)); \
                                       SSICR1_0 = 0; SSICPSR_0 = 2; \
                                       SSICR0_0 = (FRS_FREESCALE_SPI | SSI_SPO | DSS_8_BIT | ((((MASTER_CLOCK/2 + SPI_SPEED/2)/SPI_SPEED) - 1) << SSI_SCR_SHIFT)); \
                                       SSICR1_0 = SSI_SSE;
        #define WRITE_SPI_DATA(byte)   SSIDR_0 = (unsigned char)byte
        #define WRITE_SPI_CMD(byte)    SSIDR_0 = (unsigned char)byte
        #define WAIT_TRANSMISSON_END() while (SSISR_0 & SSI_BSY) {}
        #define READ_SPI_DATA()        (unsigned char)SSIDR_0
    #endif
#elif defined EK_LM3S9B90                                                // {19}
    #define DEMO_LED_1                 PORTD_BIT0
    #define DEMO_LED_2                 PORTD_BIT1
    #define DEMO_LED_3                 PORTD_BIT2
    #define DEMO_LED_4                 PORTD_BIT3
    #define DEMO_USER_PORTS            (DEMO_LED_1 | DEMO_LED_2 | DEMO_LED_3 | DEMO_LED_4)

    #define BLINK_LED                  DEMO_LED_1
    #define DEMO_DIGITAL_ENABLE        GPIODEN_D
    #define DEMO_LED_DDR               GPIODIR_D
    #define DEMO_LED_PORT              GPIODATA_D
    #ifdef USE_MAINTENANCE
        #define ENABLE_LED_PORT()      RCGC2 |= CGC_GPIOD; SRCR2 &= ~CGC_GPIOD; // clock port and ensure not in reset
    #else
        #define ENABLE_LED_PORT()      RCGC2 |= CGC_GPIOD; SRCR2 &= ~CGC_GPIOD; DEMO_DIGITAL_ENABLE = BLINK_LED; DEMO_LED_DDR = BLINK_LED; // clock port and ensure not in reset
    #endif
    #define TOGGLE_WATCHDOG_LED()      _TOGGLE_PORT(D, BLINK_LED)        // blink the LED, if set as output
    #define MEASURE_LOW_POWER_ON()     
    #define MEASURE_LOW_POWER_OFF()
#elif defined EK_LM3S1968
    #define DEMO_LED_1                 PORTG_BIT2
    #define DEMO_LED_2                 PORTG_BIT1
    #define DEMO_LED_3                 PORTG_BIT0
    #define DEMO_LED_4                 PORTG_BIT3
    #define DEMO_USER_PORTS            (DEMO_LED_1 | DEMO_LED_2 | DEMO_LED_3 | DEMO_LED_4)

    #define ENABLE_LED_PORT()          RCGC2 |= CGC_GPIOG; SRCR2 &= ~CGC_GPIOG; // clock port and ensure not in reset
    #define BLINK_LED                  DEMO_LED_1
    #define DEMO_DIGITAL_ENABLE        GPIODEN_G
    #define DEMO_LED_DDR               GPIODIR_G
    #define DEMO_LED_PORT              GPIODATA_G
    #if !defined USE_MAINTENANCE || defined REMOVE_PORT_INITIALISATIONS
        #define INIT_WATCHDOG_LED()    _CONFIG_DRIVE_PORT_OUTPUT_VALUE(G, (BLINK_LED), (BLINK_LED))
    #endif

    #define TOGGLE_WATCHDOG_LED()      _TOGGLE_PORT(G, BLINK_LED)        // blink the LED, if set as output

    #if defined SUPPORT_OLED                                             // {10} 128 x 96 OLED 
        #define CONFIGURE_OLED_DC()    _CONFIG_DRIVE_PORT_OUTPUT_VALUE(H, PORTH_BIT2, PORTH_BIT2); // DC pin
        #define ACTIVATE_OLED_POWER()  _CONFIG_DRIVE_PORT_OUTPUT_VALUE(H, PORTH_BIT3, PORTH_BIT3); // power OLDE

        // configure SSI0 peripheral lines, ensure SPI disabled (master mode). FSS automatically control sthe CS line
        // set clock prescaler (even prescale 2..254) 
        // configure SPI mode at 1MHz and final enable for operation
        #define CONFIGURE_SPI()        _CONFIG_PERIPHERAL(A, SSI0, 1, (PORTA_BIT2 | PORTA_BIT3 | PORTA_BIT5), (PA2_SSI0Clk | PA5_SSI0Tx | PA3_SSI0Fss)); \
                                       SSICR1_0 = 0; SSICPSR_0 = 2; \
                                       SSICR0_0 = (FRS_FREESCALE_SPI | SSI_SPO | DSS_8_BIT | ((((MASTER_CLOCK/2 + 1000000/2)/1000000) - 1) << SSI_SCR_SHIFT)); \
                                       SSICR1_0 = SSI_SSE;

        #define OLED_DC_L()            _CLEARBITS(H, PORTH_BIT2)
        #define OLED_DC_H()            _SETBITS(H, PORTH_BIT2)
        #define WRITE_SPI_DATA(byte)   SSIDR_0 = (unsigned char)byte
        #define WRITE_SPI_CMD(byte)    SSIDR_0 = (unsigned char)byte
        #define WAIT_TRANSMISSON_END() while (SSISR_0 & SSI_BSY) {}
        #define READ_SPI_DATA()        (unsigned char)SSIDR_0
    #endif
#elif defined IDM_L35_B
    #define DEMO_LED_1                 PORTG_BIT2
    #define DEMO_LED_2                 PORTG_BIT1
    #define DEMO_LED_3                 PORTG_BIT0
    #define DEMO_LED_4                 PORTG_BIT3
    #define DEMO_USER_PORTS            (DEMO_LED_1 | DEMO_LED_2 | DEMO_LED_3 | DEMO_LED_4)

    #define ENABLE_LED_PORT()          RCGC2 |= CGC_GPIOG; SRCR2 &= ~CGC_GPIOG; // clock port and ensure not in reset
    #define BLINK_LED                  DEMO_LED_1
    #define DEMO_DIGITAL_ENABLE        GPIODEN_G
    #define DEMO_LED_DDR               GPIODIR_G
    #define DEMO_LED_PORT              GPIODATA_G
    #define TOGGLE_WATCHDOG_LED()      _TOGGLE_PORT(G, BLINK_LED)        // blink the LED, if set as output
#elif defined _LM3S10X
    #define DEMO_LED_1                 PORTB_BIT0
    #define DEMO_LED_2                 PORTB_BIT1
    #define DEMO_LED_3                 PORTB_BIT2
    #define DEMO_LED_4                 PORTB_BIT3
    #define DEMO_USER_PORTS            (DEMO_LED_1 | DEMO_LED_2 | DEMO_LED_3 | DEMO_LED_4)

    #define ENABLE_LED_PORT()          RCGC2 |= CGC_GPIOB; SRCR2 &= ~CGC_GPIOB; // clock port and ensure not in reset
    #define BLINK_LED                  DEMO_LED_1
    #define DEMO_DIGITAL_ENABLE        GPIODEN_B
    #define DEMO_LED_DDR               GPIODIR_B
    #define DEMO_LED_PORT              GPIODATA_B
    #define TOGGLE_WATCHDOG_LED()      _TOGGLE_PORT(B, BLINK_LED)        // blink the LED, if set as output
#elif defined EK_LM3S3748 || defined EK_LM3S3768 || defined EK_LM3S5732 || defined _LM3S2110 || defined _LM3S2139 // {4}{11}
    #define DEMO_LED_1                 PORTF_BIT0
    #define DEMO_LED_2                 PORTF_BIT1
    #define DEMO_LED_3                 PORTF_BIT2
    #define DEMO_LED_4                 PORTF_BIT3
    #define DEMO_USER_PORTS            (DEMO_LED_1 | DEMO_LED_2 | DEMO_LED_3 | DEMO_LED_4)
    #if defined _LM3S2110 || defined _LM3S2139                           // {4} {11}
        #define BLINK_LED              DEMO_LED_3
    #else
        #define BLINK_LED              DEMO_LED_1
    #endif
    #define DEMO_DIGITAL_ENABLE        GPIODEN_F
    #define DEMO_LED_DDR               GPIODIR_F
    #define DEMO_LED_PORT              GPIODATA_F
    #if defined USE_MAINTENANCE
        #define ENABLE_LED_PORT()      _CONFIG_DRIVE_PORT_OUTPUT_VALUE(F, BLINK_LED, 0) // RCGC2 |= CGC_GPIOF; SRCR2 &= ~CGC_GPIOF; // clock port and ensure not in reset
    #else
        #define ENABLE_LED_PORT()      RCGC2 |= CGC_GPIOF; SRCR2 &= ~CGC_GPIOF; DEMO_DIGITAL_ENABLE = BLINK_LED; DEMO_LED_DDR = BLINK_LED; // clock port and ensure not in reset
    #endif
    #if !defined USE_MAINTENANCE || defined REMOVE_PORT_INITIALISATIONS
        #define INIT_WATCHDOG_LED()    _CONFIG_DRIVE_PORT_OUTPUT_VALUE(F, (BLINK_LED), (BLINK_LED))
    #endif
    #define TOGGLE_WATCHDOG_LED()      _TOGGLE_PORT(F, BLINK_LED)        // blink the LED, if set as output
#endif

