sWahlinRhoades/uTaskerModified/Applications/uTaskerV1.4/app_hw_lm3sxxxx.h
#define CONFIG_TIMER_TEST_LEDS()       DEMO_LED_DDR |= (DEMO_LED_3 | DEMO_LED_4)
#define TIMER_TEST_LED_ON()            DEMO_LED_PORT |= (DEMO_LED_3)
#define TIMER_TEST_LED2_ON()           DEMO_LED_PORT |= (DEMO_LED_4)
#define TIMER_TEST_LED_OFF()           DEMO_LED_PORT &= ~(DEMO_LED_3)
#define TIMER_TEST_LED2_OFF()          DEMO_LED_PORT &= ~(DEMO_LED_4)


#define CONFIG_TEST_OUTPUT()                                             // {6} we use DEMO_LED_2 which is configured by the user code (and can be disabled in parameters if required)
#define TOGGLE_TEST_OUTPUT()           DEMO_LED_PORT ^= DEMO_LED_2

// Ports
//
#if defined USE_MAINTENANCE && !defined REMOVE_PORT_INITIALISATIONS
    #define INIT_WATCHDOG_LED()        ENABLE_LED_PORT()                 // we let the application configure all LEDs but we ensure that the port is enabled to avoid any access problems
#else
    #define INIT_WATCHDOG_LED()        ENABLE_LED_PORT()
#endif
//#define TOGGLE_WATCHDOG_LED()        DEMO_LED_PORT ^= BLINK_LED        // blink the LED, if set as output

#define INIT_WATCHDOG_DISABLE()      //PMC_PCER = (PIOA)                 // ensure clocks to port
#define WATCHDOG_DISABLE()             0                                 // enable watchdog
//#define WATCHDOG_DISABLE()           1                                 // don't enable watchdog
#define WATCHDOG_TIMEOUT_MS            1500                              // watchdog timeout of 1.5 seconds (maximum at 50MHz 85s)

// GLCD
//
#if defined EK_LM3S1968                                                  // port F used a data lines, configured as inputs, port D0 used as C/D, port G 5,6,7 used as RST, RD and WR
    #define GLCD_RST               PORTG_BIT5
    #define GLCD_C_D               PORTD_BIT0
    #define GLCD_WR                PORTG_BIT7
    #define GLCD_RD                PORTG_BIT6

    #define SET_PULL_DOWNS()       GPIOPDR_F = 0xff;
    #define REMOVE_PULL_DOWNS()    GPIOPDR_F = 0x00;
    #define CONFIGURE_GLCD()       _CONFIG_DRIVE_PORT_OUTPUT_VALUE(G, (GLCD_RST | GLCD_WR | GLCD_RD), (GLCD_WR | GLCD_RD)); _CONFIG_PORT_INPUT(F, 0xff); SET_PULL_DOWNS(); _CONFIG_DRIVE_PORT_OUTPUT_VALUE(D, GLCD_C_D, GLCD_C_D)

    #define GLCD_DATAASOUTPUT()    GPIODIR_F = 0xff 
    #define GLCD_DATAASINPUT()     GPIODIR_F = 0x00 

    #define GLCD_DATAOUT(data)     GPIODATA_F = data  
    #define GLCD_DATAIN()          GPIODATA_F

    #define GLCD_WR_H()            GPIODATA_G |= GLCD_WR
    #define GLCD_WR_L()            GPIODATA_G &= ~(GLCD_WR)

    #define GLCD_CD_H()            GPIODATA_D |= GLCD_C_D
    #define GLCD_CD_L()            GPIODATA_D &= ~(GLCD_C_D)

    #define GLCD_RD_H()            GPIODATA_G |= GLCD_RD
    #define GLCD_RD_L()            GPIODATA_G &= ~(GLCD_RD)

    #define GLCD_DELAY_WRITE()     //GLCD_WR_L()                         // no write delay since the data is stable for long enough at full speed
    #define GLCD_DELAY_READ()      GLCD_RD_L()                           // one extra operation to ensure set up time of read

    #define GLCD_RST_H()           GPIODATA_G |= GLCD_RST 
    #define GLCD_RST_L()           GPIODATA_G &= ~(GLCD_RST)

    #ifdef _WINDOWS
        #define MAX_GLCD_WRITE_BURST   1000                              // the maximum number of writes to the GLCD before the task yields
    #else
        #define MAX_GLCD_WRITE_BURST   20                                // the maximum number of writes to the GLCD before the task yields
    #endif
#elif defined EK_LM3S3748 && (defined GLCD_COLOR || defined CGLCD_GLCD_MODE) // {16} color graphic LCD: port G used a data lines, configured as inputs, port E0..3 used as controls
    #define GLCD_RST               PORTE_BIT0
    #define GLCD_C_D               PORTB_BIT2
    #define GLCD_WR                PORTC_BIT4
    #define GLCD_RD                PORTC_BIT5
    #define GLCD_BACKLIGHT         PORTF_BIT1
                                   // backlight off // LCD A0 // LCD read and write lines  // data bus
    #define CONFIGURE_GLCD()       _CONFIG_DRIVE_PORT_OUTPUT_VALUE(F, (GLCD_BACKLIGHT | PORTF_BIT0), 0);  _CONFIG_DRIVE_PORT_OUTPUT_VALUE(B, (GLCD_C_D), (GLCD_C_D)); _CONFIG_DRIVE_PORT_OUTPUT_VALUE(C, (GLCD_WR | GLCD_RD), (GLCD_WR | GLCD_RD)); _CONFIG_DRIVE_PORT_OUTPUT_VALUE(G, 0xff, 0xff);
    #undef  GLCD_X                                                       // overwrite the display dimensions
    #undef  GLCD_Y
    #define GLCD_X                 128                                   // horizontal resolution of the LCD display in pixels
    #define GLCD_Y                 128                                   // vertical resolution of the LCD display in pixels
    #define ENABLE_BACKLIGHT()     _SETBITS(F, GLCD_BACKLIGHT)

    #define GLCD_DATAASOUTPUT()    GPIODIR_G = 0xff 
    #define GLCD_DATAASINPUT()     GPIODIR_G = 0x00 

    #define GLCD_DATAOUT(data)     GPIODATA_G = data  
    #define GLCD_DATAIN()          GPIODATA_G

    #define GLCD_WR_H()            GPIODATA_C |= GLCD_WR
    #define GLCD_WR_L()            GPIODATA_C &= ~(GLCD_WR)

    #define GLCD_CD_H()            GPIODATA_B &= ~GLCD_C_D               // note  - inverted to GLCD
    #define GLCD_CD_L()            GPIODATA_B |= (GLCD_C_D)

    #define GLCD_RD_H()            GPIODATA_C |= GLCD_RD
    #define GLCD_RD_L()            GPIODATA_C &= ~(GLCD_RD)

    #define GLCD_DELAY_WRITE()     //GLCD_WR_L()                         // no write delay since the data is stable for long enough at full speed
    #define GLCD_DELAY_READ()      //GLCD_RD_L()                         // no write delay since the data is stable for long enough at full speed
#else                                                                    // {9} port B used as data lines, configured as inputs, port A used as controls
    #if defined IDM_L35_B
        #define TFT_BACKLIGHT PORTH_BIT0
        #define TFT_RESET     PORTC_BIT6
        #define TFT_WRITE     PORTH_BIT1
        #define TFT_READ      PORTH_BIT2
        #define TFT_DC        PORTH_BIT3

        #define TFT_DATA_15_8 (PORTF_BIT7 | PORTF_BIT6 | PORTF_BIT5 | PORTF_BIT4 | PORTF_BIT3 | PORTF_BIT2 | PORTF_BIT1 | PORTF_BIT0)
        #define TFT_DATA_7_0  (PORTB_BIT7 | PORTB_BIT6 | PORTB_BIT5 | PORTB_BIT4 | PORTB_BIT3 | PORTB_BIT2 | PORTB_BIT1 | PORTB_BIT0)

        #define CONFIGURE_GLCD() \
            _UNLOCK_GPIO(B, PORTB_BIT7); \
            _CONFIG_DRIVE_PORT_OUTPUT_VALUE(H, (TFT_BACKLIGHT | TFT_WRITE | TFT_READ | TFT_DC), (TFT_WRITE | TFT_READ | TFT_DC)); \
            _CONFIG_DRIVE_PORT_OUTPUT_VALUE(C, TFT_RESET, 0); \
            _CONFIG_DRIVE_PORT_OUTPUT_VALUE(F, TFT_DATA_15_8, TFT_DATA_15_8); \
            _CONFIG_DRIVE_PORT_OUTPUT_VALUE(B, TFT_DATA_7_0, TFT_DATA_7_0); \
            _LOCK_PORT(B, PORTB_BIT7);
        #define GLCD_RST_H()           _SETBITS(C, TFT_RESET)
        #define ENABLE_BACKLIGHT()     _SETBITS(H, TFT_BACKLIGHT);
        #ifdef _WINDOWS
            #define MAX_GLCD_WRITE_BURST   5000                          // the maximum number of writes to the GLCD before the task yields
        #else
            #define MAX_GLCD_WRITE_BURST   100                           // the maximum number of writes to the GLCD before the task yields
        #endif
        #define SUPPORT_TOUCH_SCREEN
        #define GLCD_BACKLIGHT_CONTROL
                                                                         // revert back from peripheral use in case it was already programmed
        #define BACK_LIGHT_MAX_INTENSITY()  _RESET_PORT_PERIPHERAL(H, PORTH_BIT0); \
                                            _CONFIG_DRIVE_PORT_OUTPUT_VALUE(H, PORTH_BIT0, PORTH_BIT0);                                           
        #define BACK_LIGHT_MIN_INTENSITY()  _RESET_PORT_PERIPHERAL(H, PORTH_BIT0); \
                                            _CONFIG_DRIVE_PORT_OUTPUT_VALUE(H, PORTH_BIT0, 0);
        #define _GLCD_BACKLIGHT_TIMER       3                            // generate backlight control signal with timer 3, PWM channel A
        #define _GLCD_TIMER_MODE_OF_OPERATION  (TIMER_PWM_A)
        #define _GLCD_BACKLIGHT_PWM_FREQUENCY  TIMER_US_DELAY(TIMER_FREQUENCY_VALUE(770)) // 770 Hz backlight frequency (lowest frequency possible and should not be higher than 1kHz for good linearity)
    #elif !defined _GLCD_SAMSUNG
        #define GLCD_RST               PORTA_BIT2
        #define GLCD_C_D               PORTA_BIT3
        #define GLCD_WR                PORTA_BIT4
        #define GLCD_RD                PORTA_BIT5

        #define SET_PULL_DOWNS()       GPIOPDR_B = 0xff;
        #define REMOVE_PULL_DOWNS()    GPIOPDR_B = 0x00;

        #define CONFIGURE_GLCD()       _CONFIG_DRIVE_PORT_OUTPUT_VALUE(A, (GLCD_RST | GLCD_WR | GLCD_RD | GLCD_C_D), (GLCD_WR | GLCD_RD | GLCD_C_D)); _CONFIG_PORT_INPUT(B, 0xff); SET_PULL_DOWNS()

