sWahlinRhoades/uTaskerModified/Applications/uTaskerV1.4/app_hw_lm3sxxxx.h
        #define GLCD_DATAASOUTPUT()    GPIODIR_B = 0xff 
        #define GLCD_DATAASINPUT()     GPIODIR_B = 0x00

        #define GLCD_DATAOUT(data)     GPIODATA_B = data  
        #define GLCD_DATAIN()          GPIODATA_B

        #define GLCD_WR_H()            _SETBITS(A, GLCD_WR)
        #define GLCD_WR_L()            _CLEARBITS(A, GLCD_WR)

        #define GLCD_CD_H()            _SETBITS(A, GLCD_C_D)
        #define GLCD_CD_L()            _CLEARBITS(A, GLCD_C_D)

        #define GLCD_RD_H()            _SETBITS(A, GLCD_RD)
        #define GLCD_RD_L()            _CLEARBITS(A, GLCD_RD)

        #define GLCD_DELAY_WRITE()     //GLCD_WR_L()                     // no write delay since the data is stable for long enough at full speed
        #define GLCD_DELAY_READ()      GLCD_RD_L()                       // one extra operation to ensure set up time of read

        #define GLCD_RST_H()           _SETBITS(A, GLCD_RST)
        #define GLCD_RST_L()           _CLEARBITS(A, GLCD_RST)

        #ifdef _WINDOWS
            #define MAX_GLCD_WRITE_BURST   1000                          // the maximum number of writes to the GLCD before the task yields
        #else
            #define MAX_GLCD_WRITE_BURST   20                            // the maximum number of writes to the GLCD before the task yields
        #endif
    #else                                                                // {13}
        #define GLCD_RST               PORTC_BIT4                        // reset
        #define GLCD_RS                PORTC_BIT5                        // GLCD Register Select
        #define GLCD_RW                PORTC_BIT6                        // GLCD Read/Write
        #define GLCD_ENA               PORTC_BIT7                        // GLCD Enable

        #define GLCD_CS0               PORTH_BIT0                        // LCD Controller 0 Chip Select - 2 controller chips for 128 x 64
        #define GLCD_CS1               PORTH_BIT1                        // LCD Controller 1 Chip Select

        #define SET_PULL_DOWNS()       GPIOPDR_F = 0xff;
        #define REMOVE_PULL_DOWNS()    GPIOPDR_F = 0x00;

        #define CONFIGURE_GLCD() \
            _CONFIG_DRIVE_PORT_OUTPUT_VALUE(C, ( GLCD_RST | GLCD_RS  | \
                                                 GLCD_RW  | GLCD_ENA ),\
                                                 GLCD_RW ); \
            _CONFIG_PORT_INPUT(F, 0xff); \
            _CONFIG_DRIVE_PORT_OUTPUT_VALUE(H, ( GLCD_CS0 | GLCD_CS1 ), 0x00 );

        #define GLCD_DATAASOUTPUT()    GPIODIR_F = 0xff 
        #define GLCD_DATAASINPUT()     GPIODIR_F = 0x00 

        #define GLCD_DATAOUT(data)     GPIODATA_F = data  
        #define GLCD_DATAIN()          GPIODATA_F

        #define GLCD_RS_H()            GPIODATA_C |= GLCD_RS
        #define GLCD_RS_L()            GPIODATA_C &= ~(GLCD_RS)

        #define GLCD_RW_H()            GPIODATA_C |= GLCD_RW
        #define GLCD_RW_L()            GPIODATA_C &= ~(GLCD_RW)

        #define GLCD_CS0_H()           GPIODATA_H |= GLCD_CS0
        #define GLCD_CS0_L()           GPIODATA_H &= ~(GLCD_CS0)
    
        #define GLCD_CS1_H()           GPIODATA_H |= GLCD_CS1
        #define GLCD_CS1_L()           GPIODATA_H &= ~(GLCD_CS1)
    
        #define GLCD_DELAY_WRITE()                                       // no write delay since the data is stable for long enough at full speed
        #define GLCD_DELAY_READ()      GLCD_RW_H()                       // one extra operation to ensure set up time of read

        #define GLCD_RST_H()           GPIODATA_C |= GLCD_RST 
        #define GLCD_RST_L()           GPIODATA_C &= ~(GLCD_RST)

        #define GLCD_ENA_H()           GPIODATA_C |= GLCD_ENA
        #define GLCD_ENA_L()           GPIODATA_C &= ~(GLCD_ENA)

        #ifdef _WINDOWS
            #define MAX_GLCD_WRITE_BURST   1000                          // the maximum number of writes to the GLCD before the task yields
        #else
            #define MAX_GLCD_WRITE_BURST   80                            // the maximum number of writes to the GLCD before the task yields
        #endif
    #endif
#endif


#define PORTA_DEFAULT_INPUT        0xffffffff                            // initial port input states for simulator
#define PORTB_DEFAULT_INPUT        0xffffffff
#define PORTC_DEFAULT_INPUT        0xffffffff
#define PORTD_DEFAULT_INPUT        0xffffffff
#define PORTE_DEFAULT_INPUT        0xffffffff
#define PORTF_DEFAULT_INPUT        0xffffffff
#define PORTG_DEFAULT_INPUT        0xffffffff
#define PORTH_DEFAULT_INPUT        0xffffffff
#define PORTJ_DEFAULT_INPUT        0xffffffff

// User port mapping
//
#define USER_PORT_1_BIT            PORTB_BIT0                            // use free PA pins on Eval board
#define USER_PORT_2_BIT            PORTB_BIT1
#if defined EK_LM3S3748 && (defined GLCD_COLOR || defined CGLCD_GLCD_MODE) // {16}
    #define USER_PORT_3_BIT        0                                     // don't disturb CGLCD
#else
    #define USER_PORT_3_BIT        PORTB_BIT2
#endif
#define USER_PORT_4_BIT            PORTB_BIT3
#define USER_PORT_5_BIT            PORTB_BIT4
#define USER_PORT_6_BIT            PORTB_BIT5
#define USER_PORT_7_BIT            PORTB_BIT6
#define USER_PORT_8_BIT            PORTB_BIT7
#define USER_PORT_9_BIT            PORTC_BIT0
#define USER_PORT_10_BIT           PORTC_BIT1
#define USER_PORT_11_BIT           PORTC_BIT2
#define USER_PORT_12_BIT           PORTC_BIT3
#if defined EK_LM3S3748 && (defined GLCD_COLOR || defined CGLCD_GLCD_MODE) // {16}
    #define USER_PORT_13_BIT       0                                     // don't disturb CGLCD
    #define USER_PORT_14_BIT       0
#else
    #define USER_PORT_13_BIT       PORTC_BIT4
    #define USER_PORT_14_BIT       PORTC_BIT5
#endif
#define USER_PORT_15_BIT           PORTC_BIT6
#define USER_PORT_16_BIT           PORTC_BIT7

// Port use definitions
//
#define POWER_UP_USER_PORTS()      RCGC2 |= (CGC_GPIOB | CGC_GPIOC);

#define ENABLE_USER_PORT_1()       GPIODEN_B |= USER_PORT_1_BIT;
#define USER_PORT_1                GPIODATA_B
#define USER_DDR_1                 GPIODIR_B
#define ENABLE_USER_PORT_2()       GPIODEN_B |= USER_PORT_2_BIT;
#define USER_PORT_2                GPIODATA_B
#define USER_DDR_2                 GPIODIR_B
#define ENABLE_USER_PORT_3()       GPIODEN_B |= USER_PORT_3_BIT;
#define USER_PORT_3                GPIODATA_B
#define USER_DDR_3                 GPIODIR_B
#define ENABLE_USER_PORT_4()       GPIODEN_B |= USER_PORT_4_BIT;
#define USER_PORT_4                GPIODATA_B
#define USER_DDR_4                 GPIODIR_B
#define ENABLE_USER_PORT_5()       GPIODEN_B |= USER_PORT_5_BIT;
#define USER_PORT_5                GPIODATA_B
#define USER_DDR_5                 GPIODIR_B
#define ENABLE_USER_PORT_6()       GPIODEN_B |= USER_PORT_6_BIT;
#define USER_PORT_6                GPIODATA_B
#define USER_DDR_6                 GPIODIR_B
#define ENABLE_USER_PORT_7()       GPIODEN_B |= USER_PORT_7_BIT;
#define USER_PORT_7                GPIODATA_B
#define USER_DDR_7                 GPIODIR_B
#define ENABLE_USER_PORT_8()       GPIODEN_B |= USER_PORT_8_BIT;
#define USER_PORT_8                GPIODATA_B
#define USER_DDR_8                 GPIODIR_B
#define ENABLE_USER_PORT_9()       GPIODEN_C |= USER_PORT_9_BIT;
#define USER_PORT_9                GPIODATA_C
#define USER_DDR_9                 GPIODIR_C
#define ENABLE_USER_PORT_10()      GPIODEN_C |= USER_PORT_10_BIT;
#define USER_PORT_10               GPIODATA_C
#define USER_DDR_10                GPIODIR_C
#define ENABLE_USER_PORT_11()      GPIODEN_C |= USER_PORT_11_BIT;
#define USER_PORT_11               GPIODATA_C
#define USER_DDR_11                GPIODIR_C
#define ENABLE_USER_PORT_12()      GPIODEN_C |= USER_PORT_12_BIT;
#define USER_PORT_12               GPIODATA_C
#define USER_DDR_12                GPIODIR_C
#define ENABLE_USER_PORT_13()      GPIODEN_C |= USER_PORT_13_BIT;
#define USER_PORT_13               GPIODATA_C
#define USER_DDR_13                GPIODIR_C
#define ENABLE_USER_PORT_14()      GPIODEN_C |= USER_PORT_14_BIT;
#define USER_PORT_14               GPIODATA_C
#define USER_DDR_14                GPIODIR_C
#define ENABLE_USER_PORT_15()      GPIODEN_C |= USER_PORT_15_BIT;
#define USER_PORT_15               GPIODATA_C
#define USER_DDR_15                GPIODIR_C
#define ENABLE_USER_PORT_16()      GPIODEN_C |= USER_PORT_16_BIT;
#define USER_PORT_16               GPIODATA_C
#define USER_DDR_16                GPIODIR_C

#if defined KEY_COLUMNS && KEY_COLUMNS > 0
    // Keypad (scan out D4..D7, scan in E0..E3)                          // {12}
    //
    #define KEY_ROW_IN_1               PORTE_BIT0
    #define KEY_ROW_IN_2               PORTE_BIT1
    #define KEY_ROW_IN_3               PORTE_BIT2
    #define KEY_ROW_IN_4               PORTE_BIT3

    #define KEY_ROW_IN_PORT_1_REF      E
    #define KEY_ROW_IN_PORT_2_REF      E
    #define KEY_ROW_IN_PORT_3_REF      E
    #define KEY_ROW_IN_PORT_4_REF      E

    #define KEY_COL_OUT_1              PORTD_BIT4
    #define KEY_COL_OUT_2              PORTD_BIT5
    #define KEY_COL_OUT_3              PORTD_BIT6
    #define KEY_COL_OUT_4              PORTD_BIT7

