sWahlinRhoades/uTaskerModified/Applications/uTaskerV1.4/app_hw_lm3sxxxx.h
    #define KEY_COL_OUT_PORT_1         GPIODATA_D
    #define KEY_COL_OUT_DDR_1          GPIODIR_D
    #define KEY_COL_OUT_PORT_2         GPIODATA_D
    #define KEY_COL_OUT_DDR_2          GPIODIR_D
    #define KEY_COL_OUT_PORT_3         GPIODATA_D
    #define KEY_COL_OUT_DDR_3          GPIODIR_D
    #define KEY_COL_OUT_PORT_4         GPIODATA_D
    #define KEY_COL_OUT_DDR_4          GPIODIR_D

                                                                         // drive each column low
    #define DRIVE_COLUMN_1()           _DRIVE_PORT_OUTPUT_VALUE(D, KEY_COL_OUT_1, 0) // drive output low (column 1)
    #define DRIVE_COLUMN_2()           _DRIVE_PORT_OUTPUT_VALUE(D, KEY_COL_OUT_2, 0) // drive output low (column 2)
    #define DRIVE_COLUMN_3()           _DRIVE_PORT_OUTPUT_VALUE(D, KEY_COL_OUT_3, 0) // drive output low (column 3)
    #define DRIVE_COLUMN_4()           _DRIVE_PORT_OUTPUT_VALUE(D, KEY_COL_OUT_4, 0) // drive output low (column 4)

                                                                         // drive high (to avoid slow rise time) then set back as input
    #define RELEASE_COLUMN_1()         _SETBITS(D, KEY_COL_OUT_1); _FLOAT_PORT(D, KEY_COL_OUT_1) 
    #define RELEASE_COLUMN_2()         _SETBITS(D, KEY_COL_OUT_2); _FLOAT_PORT(D, KEY_COL_OUT_2)
    #define RELEASE_COLUMN_3()         _SETBITS(D, KEY_COL_OUT_3); _FLOAT_PORT(D, KEY_COL_OUT_3)
    #define RELEASE_COLUMN_4()         _SETBITS(D, KEY_COL_OUT_4); _FLOAT_PORT(D, KEY_COL_OUT_4)

    #define KEY_ROW_IN_PORT_1          GPIODATA_E
    #define KEY_ROW_IN_PORT_2          GPIODATA_E
    #define KEY_ROW_IN_PORT_3          GPIODATA_E
    #define KEY_ROW_IN_PORT_4          GPIODATA_E

    #define RESET_SCAN()                                                 // reset any changes ready for next scan sequence       

    #define INIT_KEY_SCAN()            _CONFIG_PORT_INPUT(E, (KEY_ROW_IN_1 | KEY_ROW_IN_2 | KEY_ROW_IN_3 | KEY_ROW_IN_4)); \
                                       GPIOPUR_E |= (KEY_ROW_IN_1 | KEY_ROW_IN_2 | KEY_ROW_IN_3 | KEY_ROW_IN_4); \
                                       _CONFIG_PORT_INPUT(D, (KEY_COL_OUT_1 | KEY_COL_OUT_2 | KEY_COL_OUT_3 | KEY_COL_OUT_4));
#else                                                                    // not matrix scanning input
  #if defined EK_LM3S2139
    #define KEY_IN_1                   PORTG_BIT0
    #define KEY_IN_2                   PORTG_BIT1
    #define KEY_IN_3                   PORTG_BIT2
    #define KEY_IN_4                   PORTG_BIT3
    #define KEY_IN_5                   PORTG_BIT4
    #define KEY_IN_6                   PORTG_BIT5
    #define KEY_IN_7                   PORTG_BIT6
    #define KEY_IN_8                   PORTG_BIT7

    #define INIT_KEY_STATE             (KEY_IN_1 | KEY_IN_2 | KEY_IN_3 | KEY_IN_4 | KEY_IN_5 | KEY_IN_6 | KEY_IN_7 | KEY_IN_8) // all keys are expected to be pulled up at start

    #define INIT_KEY_SCAN()            _CONFIG_PORT_INPUT(G, (KEY_IN_1 | KEY_IN_2 | KEY_IN_3 | KEY_IN_4 | KEY_IN_5 | KEY_IN_6 | KEY_IN_7 | KEY_IN_8)); GPIOPUR_G |= (KEY_IN_1 | KEY_IN_2 | KEY_IN_3 | KEY_IN_4 | KEY_IN_5 | KEY_IN_6 | KEY_IN_7 | KEY_IN_8)
    #define READ_KEY_INPUTS()          _READ_PORT(G)


    #define KEY_1_PORT_REF             G                                 // to allow simulator to map key pad to inputs
    #define KEY_1_PORT_PIN             KEY_IN_1
    #define KEY_5_PORT_REF             G
    #define KEY_5_PORT_PIN             KEY_IN_2
    #define KEY_9_PORT_REF             G
    #define KEY_9_PORT_PIN             KEY_IN_3
    #define KEY_13_PORT_REF            G
    #define KEY_13_PORT_PIN            KEY_IN_4

    #define KEY_2_PORT_REF             G
    #define KEY_2_PORT_PIN             KEY_IN_5
    #define KEY_6_PORT_REF             G
    #define KEY_6_PORT_PIN             KEY_IN_6
    #define KEY_10_PORT_REF            G
    #define KEY_10_PORT_PIN            KEY_IN_7
    #define KEY_14_PORT_REF            G
    #define KEY_14_PORT_PIN            KEY_IN_8
  #elif defined EK_LM3S8962
    #define KEY_IN_1                   PORTE_BIT0
    #define KEY_IN_2                   PORTE_BIT2
    #define KEY_IN_3                   PORTE_BIT3
    #define KEY_IN_4                   PORTE_BIT1
    #define KEY_IN_5                   PORTF_BIT1


    #define INIT_KEY_STATE             (0x1f)                            // all keys are expected to be pulled up at start

    #define INIT_KEY_SCAN()            _CONFIG_PORT_INPUT(E, (KEY_IN_1 | KEY_IN_2 | KEY_IN_3 | KEY_IN_4)); GPIOPUR_E |= (KEY_IN_1 | KEY_IN_2 | KEY_IN_3 | KEY_IN_4); \
                                       _CONFIG_PORT_INPUT(F, (KEY_IN_5)); GPIOPUR_F |= (KEY_IN_5)

    #define READ_KEY_INPUTS()          _READ_PORT_MASK(E, (KEY_IN_1 | KEY_IN_2 | KEY_IN_3 | KEY_IN_4)) | (_READ_PORT_MASK(F, KEY_IN_5) << 3)


    #define KEY_1_PORT_REF             E                                 // to allow simulator to map key pad to inputs
    #define KEY_1_PORT_PIN             KEY_IN_1
    #define KEY_5_PORT_REF             E
    #define KEY_5_PORT_PIN             KEY_IN_2
    #define KEY_9_PORT_REF             E
    #define KEY_9_PORT_PIN             KEY_IN_3
    #define KEY_2_PORT_REF             E
    #define KEY_2_PORT_PIN             KEY_IN_4
    #define KEY_6_PORT_REF             F
    #define KEY_6_PORT_PIN             KEY_IN_5
  #else
    #define KEY_IN_1                   PORTD_BIT0
    #define KEY_IN_2                   PORTD_BIT1
    #define KEY_IN_3                   PORTD_BIT2
    #define KEY_IN_4                   PORTD_BIT3
    #define KEY_IN_5                   PORTD_BIT4
    #define KEY_IN_6                   PORTD_BIT5
    #define KEY_IN_7                   PORTD_BIT6
    #define KEY_IN_8                   PORTD_BIT7

    #define INIT_KEY_STATE             (KEY_IN_1 | KEY_IN_2 | KEY_IN_3 | KEY_IN_4 | KEY_IN_5 | KEY_IN_6 | KEY_IN_7 | KEY_IN_8) // all keys are expected to be pulled up at start

    #define INIT_KEY_SCAN()            _CONFIG_PORT_INPUT(D, (KEY_IN_1 | KEY_IN_2 | KEY_IN_3 | KEY_IN_4 | KEY_IN_5 | KEY_IN_6 | KEY_IN_7 | KEY_IN_8)); GPIOPUR_D |= (KEY_IN_1 | KEY_IN_2 | KEY_IN_3 | KEY_IN_4 | KEY_IN_5 | KEY_IN_6 | KEY_IN_7 | KEY_IN_8)
    #define READ_KEY_INPUTS()          _READ_PORT(D)


    #define KEY_1_PORT_REF             D                                 // to allow simulator to map key pad to inputs
    #define KEY_1_PORT_PIN             KEY_IN_1
    #define KEY_5_PORT_REF             D
    #define KEY_5_PORT_PIN             KEY_IN_2
    #define KEY_9_PORT_REF             D
    #define KEY_9_PORT_PIN             KEY_IN_3
    #define KEY_13_PORT_REF            D
    #define KEY_13_PORT_PIN            KEY_IN_4

