sWahlinRhoades/uTaskerModified/Applications/uTaskerV1.4/app_hw_lm3sxxxx.h
    #define KEY_2_PORT_REF             D
    #define KEY_2_PORT_PIN             KEY_IN_5
    #define KEY_6_PORT_REF             D
    #define KEY_6_PORT_PIN             KEY_IN_6
    #define KEY_10_PORT_REF            D
    #define KEY_10_PORT_PIN            KEY_IN_7
    #define KEY_14_PORT_REF            D
    #define KEY_14_PORT_PIN            KEY_IN_8
  #endif
#endif

// LCD interface: Backlight control PORTE_BIT0 : Data bus (4 Bit) PORTA_BIT7..PORTA_BIT4 / (8 bit) PORTA_BIT7..PORTA_BIT0 : RS PORTE_BIT1, RW PORTE_BIT2, E PORTE_BIT3
//
typedef unsigned char LCD_BUS_PORT_SIZE;                                 // we use 8 bit ports
typedef unsigned char LCD_CONTROL_PORT_SIZE;
//#define LCD_BUS_8BIT                                                   // data bus in 8 bit mode
#define LCD_BUS_4BIT                                                     // data bus in 4 bit mode

#ifdef LCD_BUS_8BIT
    #define LCD_BUS_MASK         0xff
    #define DATA_SHIFT_RIGHT     0
    #define DATA_SHIFT_LEFT      0                                       // byte shift down required to bring data into position
#else
    #define LCD_BUS_MASK         0xf0
    #define DATA_SHIFT_RIGHT     0
    #define DATA_SHIFT_LEFT      0                                       // nibble shift down required to bring data into position
#endif

#define O_CONTROL_RS            PORTE_BIT1
#define O_WRITE_READ            PORTE_BIT2
#define O_CONTROL_EN            PORTE_BIT3
#define O_LCD_BACKLIGHT         PORTE_BIT0

#define O_CONTROL_LINES         (O_CONTROL_RS | O_WRITE_READ | O_CONTROL_EN)
#define IO_BUS_PORT_DAT         GPIODATA_A
#define IO_BUS_PORT_DAT_IN      GPIODATA_A
#define O_CONTROL_PORT_DAT      GPIODATA_E
#define IO_BUS_PORT_DDR         GPIODIR_A

#define SET_DATA_LINES_INPUT()  IO_BUS_PORT_DDR &= ~LCD_BUS_MASK; _SIM_PORTS
#define SET_DATA_LINES_OUTPUT() IO_BUS_PORT_DDR |= LCD_BUS_MASK; _SIM_PORTS
#define SET_BUS_DATA(x)         IO_BUS_PORT_DAT = x; _SIM_PORTS;
#define O_SET_CONTROL_LOW(x)    O_CONTROL_PORT_DAT &= ~x; _SIM_PORTS;
#define O_SET_CONTROL_HIGH(x)   O_CONTROL_PORT_DAT |= x; _SIM_PORTS;

// Drive the control lines R/W + LCD Backlight '1', RS + E '0' and the data lines with all high impedance at start up
// enable clocks to port first
#define INITIALISE_LCD_CONTROL_LINES()       RCGC2 |= (CGC_GPIOA | CGC_GPIOE); \
                                             GPIODEN_A |= LCD_BUS_MASK; GPIODEN_E |= (O_CONTROL_LINES | O_LCD_BACKLIGHT); \
                                             SET_DATA_LINES_INPUT(); \
                                             GPIODIR_E = (O_CONTROL_LINES | O_LCD_BACKLIGHT); \
                                             O_SET_CONTROL_LOW(O_CONTROL_LINES); _SIM_PORTS; O_SET_CONTROL_HIGH(O_LCD_BACKLIGHT); \
                                             _SIM_PORTS;

#define LCD_DRIVE_DATA()          SET_DATA_LINES_OUTPUT();  SET_DATA_LINES_OUTPUT();
                                  // ensure data bus outputs (delay) by repetitions according to processor speed

#define CLOCK_EN_HIGH()           O_SET_CONTROL_HIGH(O_CONTROL_EN); O_SET_CONTROL_HIGH(O_CONTROL_EN); _SIM_PORTS;
                                  // clock EN to high state - repeat to slow down (delay)

#define DELAY_ENABLE_CLOCK_HIGH() O_CONTROL_PORT_DAT &= ~(O_CONTROL_EN);

#endif                                                                   // endif - defined _LM3SXXXX && !defined __APP_HW_LM3SXXXX__
